{
  "format": "graph-model",
  "generatedBy": "2.11.0",
  "convertedBy": "TensorFlow.js Converter v4.6.0",
  "signature": {
    "inputs": {
      "conv2d_input": {
        "name": "conv2d_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "28" },
            { "size": "28" },
            { "size": "1" }
          ]
        }
      }
    },
    "outputs": {
      "dense_1": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "24" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "1" },
                  { "size": "100" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "100" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "100" },
                  { "size": "75" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "75" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "75" },
                  { "size": "50" }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "50" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/flatten/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "200" }, { "size": "288" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "288" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "288" }, { "size": "24" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "24" }] }
            }
          }
        }
      },
      {
        "name": "conv2d_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "28" },
                { "size": "28" },
                { "size": "1" }
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "75" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "100" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "100" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "50" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "50" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "75" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d/Relu",
        "op": "_FusedConv2D",
        "input": [
          "conv2d_input",
          "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "use_cudnn_on_gpu": { "b": true },
          "num_args": { "i": "1" },
          "num_host_args": { "i": "0" },
          "padding": { "s": "VkFMSUQ=" },
          "filter_format": { "s": "SFdJTw==" },
          "data_format": { "s": "TkhXQw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/sequential/conv2d/Relu",
          "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3",
        "op": "Add",
        "input": [
          "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Mul",
          "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3"
        ],
        "attr": {
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d/MaxPool",
          "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "num_host_args": { "i": "0" },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "padding": { "s": "VkFMSUQ=" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "filter_format": { "s": "SFdJTw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/sequential/conv2d_1/Relu",
          "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3",
        "op": "Add",
        "input": [
          "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Mul",
          "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3"
        ],
        "attr": {
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/conv2d_2/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d_1/MaxPool",
          "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "leakyrelu_alpha": { "f": 0.2 },
          "explicit_paddings": { "list": {} },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "filter_format": { "s": "SFdJTw==" },
          "num_host_args": { "i": "0" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "padding": { "s": "VkFMSUQ=" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/sequential/conv2d_2/Relu",
          "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3",
        "op": "Add",
        "input": [
          "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Mul",
          "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential/max_pooling2d_2/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3"
        ],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "explicit_paddings": { "list": {} },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/flatten/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential/max_pooling2d_2/MaxPool",
          "StatefulPartitionedCall/sequential/flatten/Const"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/flatten/Reshape",
          "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_b": { "b": false },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential/dense/Relu",
          "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "leakyrelu_alpha": { "f": 0.2 },
          "transpose_b": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential/dense_1/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/sequential/dense_1/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential/dense_1/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1395 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential/conv2d/Conv2D/ReadVariableOp",
          "shape": [3, 3, 1, 100],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d/BiasAdd/ReadVariableOp",
          "shape": [100],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_1/Conv2D/ReadVariableOp",
          "shape": [3, 3, 100, 75],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_1/BiasAdd/ReadVariableOp",
          "shape": [75],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_2/Conv2D/ReadVariableOp",
          "shape": [3, 3, 75, 50],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/conv2d_2/BiasAdd/ReadVariableOp",
          "shape": [50],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/flatten/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp",
          "shape": [200, 288],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp",
          "shape": [288],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp",
          "shape": [288, 24],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp",
          "shape": [24],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Offset",
          "shape": [75],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Scaled",
          "shape": [100],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/batch_normalization/FusedBatchNormV3/Offset",
          "shape": [100],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Scaled",
          "shape": [50],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/batch_normalization_2/FusedBatchNormV3/Offset",
          "shape": [50],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential/batch_normalization_1/FusedBatchNormV3/Scaled",
          "shape": [75],
          "dtype": "float32"
        }
      ]
    }
  ]
}
